; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	image1 - mode
	spectrograph4 - mode
	infrared3 - mode
	thermograph0 - mode
	image2 - mode
	Star5 - direction
	GroundStation6 - direction
	Star14 - direction
	GroundStation0 - direction
	GroundStation13 - direction
	Star11 - direction
	Star8 - direction
	Star2 - direction
	GroundStation3 - direction
	Star12 - direction
	Star1 - direction
	Star9 - direction
	Star4 - direction
	GroundStation7 - direction
	GroundStation10 - direction
	Star15 - direction
	Phenomenon16 - direction
	Planet17 - direction
	Star18 - direction
)
(:init
	(supports instrument0 spectrograph4)
	(calibration_target instrument0 Star9)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 image2)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star4)
	(calibration_target instrument1 GroundStation0)
	(calibration_target instrument1 Star14)
	(calibration_target instrument1 Star11)
	(calibration_target instrument1 Star12)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument2 image2)
	(supports instrument2 spectrograph4)
	(supports instrument2 infrared3)
	(calibration_target instrument2 Star4)
	(calibration_target instrument2 Star12)
	(calibration_target instrument2 GroundStation13)
	(calibration_target instrument2 GroundStation10)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star4)
	(supports instrument3 spectrograph4)
	(calibration_target instrument3 Star11)
	(calibration_target instrument3 Star4)
	(calibration_target instrument3 GroundStation7)
	(supports instrument4 infrared3)
	(supports instrument4 image2)
	(calibration_target instrument4 GroundStation3)
	(calibration_target instrument4 GroundStation7)
	(supports instrument5 image2)
	(supports instrument5 infrared3)
	(calibration_target instrument5 Star12)
	(calibration_target instrument5 GroundStation3)
	(calibration_target instrument5 Star2)
	(calibration_target instrument5 GroundStation10)
	(calibration_target instrument5 Star8)
	(supports instrument6 spectrograph4)
	(supports instrument6 image2)
	(calibration_target instrument6 Star4)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon16)
	(supports instrument7 infrared3)
	(supports instrument7 thermograph0)
	(supports instrument7 spectrograph4)
	(calibration_target instrument7 Star1)
	(supports instrument8 thermograph0)
	(supports instrument8 spectrograph4)
	(supports instrument8 image1)
	(calibration_target instrument8 Star4)
	(calibration_target instrument8 Star9)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star12)
	(supports instrument9 image1)
	(supports instrument9 thermograph0)
	(calibration_target instrument9 GroundStation10)
	(calibration_target instrument9 GroundStation7)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation0)
)
(:goal (and
	(pointing satellite1 Phenomenon16)
	(pointing satellite2 GroundStation13)
	(pointing satellite4 Planet17)
	(have_image Star15 image1)
	(have_image Phenomenon16 image2)
	(have_image Planet17 spectrograph4)
	(have_image Star18 thermograph0)
))

)

; plan
1. (turn_to satellite4 planet17 groundstation0)
   deleted: (pointing satellite4 groundstation0)
   added: (pointing satellite4 planet17)
   goals met: 1 of 7
2. (turn_to satellite3 star4 star12)
   deleted: (pointing satellite3 star12)
   added: (pointing satellite3 star4)
   goals met: 1 of 7
3. (switch_on instrument8 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument8)
   goals met: 1 of 7
4. (calibrate satellite3 instrument8 star4)
   added: (calibrated instrument8)
   goals met: 1 of 7
5. (turn_to satellite3 planet17 star4)
   deleted: (pointing satellite3 star4)
   added: (pointing satellite3 planet17)
   goals met: 1 of 7
6. (turn_to satellite2 groundstation13 phenomenon16)
   deleted: (pointing satellite2 phenomenon16)
   added: (pointing satellite2 groundstation13)
   goals met: 2 of 7
7. (take_image satellite3 planet17 instrument8 spectrograph4)
   added: (have_image planet17 spectrograph4)
   goals met: 3 of 7
8. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 3 of 7
9. (calibrate satellite1 instrument2 star4)
   added: (calibrated instrument2)
   goals met: 3 of 7
10. (turn_to satellite1 phenomenon16 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 phenomenon16)
   goals met: 4 of 7
11. (take_image satellite1 phenomenon16 instrument2 image2)
   added: (have_image phenomenon16 image2)
   goals met: 5 of 7
12. (turn_to satellite3 star15 planet17)
   deleted: (pointing satellite3 planet17)
   added: (pointing satellite3 star15)
   goals met: 5 of 7
13. (take_image satellite3 star15 instrument8 image1)
   added: (have_image star15 image1)
   goals met: 6 of 7
14. (turn_to satellite3 star18 star15)
   deleted: (pointing satellite3 star15)
   added: (pointing satellite3 star18)
   goals met: 6 of 7
15. (take_image satellite3 star18 instrument8 thermograph0)
   added: (have_image star18 thermograph0)
   goals met: 7 of 7
